tutorials/natConvSquareCloud/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

omegaInlet  0.4;

internalField   uniform $omegaInlet;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    bottom
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform $omegaInlet;
        value           uniform $omegaInlet;
    }
}

// ************************************************************************* //
